&НаКлиенте

Перем АдресВХранилище;


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Строки = ПодсчетКоличестваДней();  

	Для каждого стр из Объект.ОтпускаСотрудников Цикл
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();  
	ЭлементОформления.Использование = Истина;     
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Коралловый);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Сотрудник");
	ЭлементОтбора.ПравоеЗначение = Строки; 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование = Истина;

	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковСотрудник");
	ПолеОформления.Использование = Истина;    
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	АдресВХранилище = ПоместитьВХранилище();
	
	ПараметрыПодбора = Новый Структура("Адрес", АдресВХранилище);
	
	ФормаПодбора = ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыПодбора, ЭтаФорма);
	
КонецПроцедуры

&НаСервере

Функция ПоместитьВХранилище()
    
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(),УникальныйИдентификатор);  
	
КонецФункции     

  &НаСервере
Функция ПодсчетКоличестваДней()   
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ПлановыеОтпуска.Сотрудник КАК Сотрудник,
	|	СУММА(ВКМ_ПлановыеОтпуска.КоличествоДней) КАК КоличествоДней
	|ИЗ
	|	РегистрНакопления.ВКМ_ПлановыеОтпуска КАК ВКМ_ПлановыеОтпуска
	|ГДЕ
	|	ВКМ_ПлановыеОтпуска.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ПлановыеОтпуска.Сотрудник";
	
	Запрос.УстановитьПараметр("Регистратор",Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СписокСотрудниковДляПодсветки = Новый СписокЗначений;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.КоличествоДней > 28 Тогда
			СписокСотрудниковДляПодсветки.Добавить(ВыборкаДетальныеЗаписи.Сотрудник);
		КонецЕсли;	 
	КонецЦикла;
	
	Возврат СписокСотрудниковДляПодсветки;
	
КонецФункции	  
