# Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
		|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_ДополнительныеНачисления.Результат КАК СуммаПремии
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();   
	
	Объект.СписокСотрудников.Очистить();    
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = Объект.СписокСотрудников.Добавить();
		НоваяСтрока.ВидРасчета = ВыборкаДетальныеЗаписи.ВидРасчета;
		НоваяСтрока.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		НоваяСтрока.СуммаПремии = ВыборкаДетальныеЗаписи.СуммаПремии;
		ИзменитьДоступностьПоляСуммаПремии();
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти




# Область ОбработчикиСобытийЭлементовТаблицыФормыСписокСотрудников

&НаКлиенте
Процедура СписокСотрудниковВидРасчетаПриИзменении(Элемент)
		
	ИзменитьДоступностьПоляСуммаПремии();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаСервере
Процедура ИзменитьДоступностьПоляСуммаПремии();
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();  
	ЭлементОформления.Использование = Истина;     
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",Истина);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СписокСотрудников.ВидРасчета");
	ЭлементОтбора.ПравоеЗначение = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентЗаВыполненныеРаботы; 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;

	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СписокСотрудниковСуммаПремии");
	ПолеОформления.Использование = Истина;    
	
		
КонецПроцедуры
#КонецОбласти