#Область ОбработчикиСобытийФормы
	&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда

	ДобавлениеРеквизитов();	
		
КонецЕсли; 

КонецПроцедуры


 
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ВКМ Добавление доп. реквизитов на форму при выборе выида договора Абонентское обслуживание
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		
		ДобавлениеРеквизитов(); 
		
	Иначе УдалениеРеквизитов(); 
		
	КонецЕсли;	   
	
КонецПроцедуры       

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

 &НаСервере
  Процедура ДобавлениеРеквизитов()   
	  
	  
	  Если Элементы.Найти("ФормаВКМ_ДатаНачала")= Неопределено Тогда  
		  
		  ПолеВвода = Элементы.Добавить("ФормаВКМ_ДатаНачала", Тип("ПолеФормы"), ЭтотОбъект);
		  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		  ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачала"; 
		  
	  КонецЕсли;
	  Если Элементы.Найти("ФормаВКМ_ДатаОкончания")= Неопределено Тогда
		  
		  ПолеВвода = Элементы.Добавить("ФормаВКМ_ДатаОкончания", Тип("ПолеФормы"), ЭтотОбъект);
		  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		  ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";  
	  КонецЕсли;
	  Если Элементы.Найти("ФормаВКМ_СуммаЕжемесячнойПлаты")= Неопределено Тогда
		  
		  ПолеВвода = Элементы.Добавить("ФормаВКМ_СуммаЕжемесячнойПлаты", Тип("ПолеФормы"), ЭтотОбъект);
		  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		  ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаЕжемесячнойПлаты";  
	  КонецЕсли;
	  
	  Если Элементы.Найти("ФормаВКМ_СтоимостьЧаса")= Неопределено Тогда
		  ПолеВвода = Элементы.Добавить("ФормаВКМ_СтоимостьЧаса", Тип("ПолеФормы"), ЭтотОбъект);
		  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		  ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса";    
	  КонецЕсли;
   	  
КонецПроцедуры	 


 &НаСервере
 Процедура  УдалениеРеквизитов();  
	 
	 Если Элементы.Найти("ФормаВКМ_ДатаНачала")<> Неопределено Тогда
		 Элементы.Удалить(Элементы.ФормаВКМ_ДатаНачала);
	 КонецЕсли;	
	 Если Элементы.Найти("ФормаВКМ_ДатаОкончания")<> Неопределено Тогда
		 Элементы.Удалить(Элементы.ФормаВКМ_ДатаОкончания);
	 КонецЕсли;	
	 Если Элементы.Найти("ФормаВКМ_СуммаЕжемесячнойПлаты")<> Неопределено Тогда
		 Элементы.Удалить(Элементы.ФормаВКМ_СуммаЕжемесячнойПлаты);
	 КонецЕсли;	
	 Если Элементы.Найти("ФормаВКМ_СтоимостьЧаса")<> Неопределено Тогда
		 Элементы.Удалить(Элементы.ФормаВКМ_СтоимостьЧаса);
	 КонецЕсли;	
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ДоговорыКонтрагентов.ВКМ_ДатаНачала КАК ВКМ_ДатаНачала,
	 |	ДоговорыКонтрагентов.ВКМ_ДатаОкончания КАК ВКМ_ДатаОкончания,
	 |	ДоговорыКонтрагентов.ВКМ_СуммаЕжемесячнойПлаты КАК ВКМ_СуммаЕжемесячнойПлаты,
	 |	ДоговорыКонтрагентов.ВКМ_СтоимостьЧаса КАК ВКМ_СтоимостьЧаса
	 |ИЗ
	 |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	 |ГДЕ
	 |	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	 
	 Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	 
	 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
		 Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВКМ_ДатаНачала) Тогда
			 Объект.ВКМ_ДатаНачала = Неопределено; 
			 
		 КонецЕсли;   
		 
		 Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВКМ_ДатаОкончания) Тогда
			 Объект.ВКМ_ДатаОкончания = Неопределено;
		 КонецЕсли;  
		 
		 Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВКМ_СуммаЕжемесячнойПлаты) Тогда
			 Объект.ВКМ_СуммаЕжемесячнойПлаты = Неопределено;
		 КонецЕсли;  
		 
		 Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВКМ_СтоимостьЧаса) Тогда
			 Объект.ВКМ_СтоимостьЧаса = Неопределено;
		 КонецЕсли;  
		 
	 КонецЦикла;
	 
КонецПроцедуры	 

// ВКМ Добавление доп. реквизитов на форму при выборе выида договора Абонентское обслуживание

#КонецОбласти