#Область ОбработчикиСобытийФормы
	&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавлениеРеквизитов();	
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда	
		
		ИзменениеВидимостиДобавленныхРеквизитов();
		
	КонецЕсли;                                    
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ВКМ Добавление доп. реквизитов на форму при выборе вида договора Абонентское обслуживание
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)

		
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
	
	ДобавлениеРеквизитов();	

	ИзменениеВидимостиДобавленныхРеквизитов();
		
	Иначе УдалениеРеквизитов(); 
		
	КонецЕсли;	   
	
КонецПроцедуры       

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

 &НаСервере
  Процедура ДобавлениеРеквизитов()   
	  
	  
	  Если Элементы.Найти("ФормаВКМ_ДатаНачала")= Неопределено Тогда  
		  
		  ПолеВвода = Элементы.Добавить("ФормаВКМ_ДатаНачала", Тип("ПолеФормы"), ЭтотОбъект);
		  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		  ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
		  ПолеВвода.Видимость = Ложь;
		  
	  КонецЕсли;
	  Если Элементы.Найти("ФормаВКМ_ДатаОкончания")= Неопределено Тогда
		  
		  ПолеВвода = Элементы.Добавить("ФормаВКМ_ДатаОкончания", Тип("ПолеФормы"), ЭтотОбъект);
		  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		  ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";     
		  ПолеВвода.Видимость = Ложь;
	  КонецЕсли;
	  Если Элементы.Найти("ФормаВКМ_СуммаЕжемесячнойПлаты")= Неопределено Тогда
		  
		  ПолеВвода = Элементы.Добавить("ФормаВКМ_СуммаЕжемесячнойПлаты", Тип("ПолеФормы"), ЭтотОбъект);
		  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		  ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаЕжемесячнойПлаты";   
		  ПолеВвода.Видимость = Ложь;
	  КонецЕсли;
	  
	  Если Элементы.Найти("ФормаВКМ_СтоимостьЧаса")= Неопределено Тогда
		  ПолеВвода = Элементы.Добавить("ФормаВКМ_СтоимостьЧаса", Тип("ПолеФормы"), ЭтотОбъект);
		  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		  ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса";  
		  ПолеВвода.Видимость = Ложь;
	  КонецЕсли;
   	  
КонецПроцедуры	 

&НаСервере
Процедура ИзменениеВидимостиДобавленныхРеквизитов()
   
	
	ДатаНачала =  Элементы.Найти("ФормаВКМ_ДатаНачала");
	ДатаНачала.Видимость = Истина;  
	
	
	ДатаОкончания = Элементы.Найти("ФормаВКМ_ДатаОкончания");
	ДатаОкончания.Видимость = Истина;
	
	СуммаЕжемесячнойПлаты = Элементы.Найти("ФормаВКМ_СуммаЕжемесячнойПлаты");
	СуммаЕжемесячнойПлаты.Видимость = Истина;
	
	СтоимостьЧаса = Элементы.Найти("ФормаВКМ_СтоимостьЧаса");
	СтоимостьЧаса.Видимость = Истина; 
	
	
КонецПроцедуры	

 &НаСервере
 Процедура  УдалениеРеквизитов();  
	 
	 Если Элементы.Найти("ФормаВКМ_ДатаНачала")<> Неопределено Тогда
		 Элементы.Удалить(Элементы.ФормаВКМ_ДатаНачала); 
		 Объект.ВКМ_ДатаНачала = Неопределено; 
		 
	 КонецЕсли;	
	 Если Элементы.Найти("ФормаВКМ_ДатаОкончания")<> Неопределено Тогда
		 Элементы.Удалить(Элементы.ФормаВКМ_ДатаОкончания);    
		 Объект.ВКМ_ДатаОкончания = Неопределено;
	 КонецЕсли;	
	 Если Элементы.Найти("ФормаВКМ_СуммаЕжемесячнойПлаты")<> Неопределено Тогда
		 Элементы.Удалить(Элементы.ФормаВКМ_СуммаЕжемесячнойПлаты);  
		 Объект.ВКМ_СуммаЕжемесячнойПлаты = Неопределено;
		 
	 КонецЕсли;	
	 Если Элементы.Найти("ФормаВКМ_СтоимостьЧаса")<> Неопределено Тогда
		 Элементы.Удалить(Элементы.ФормаВКМ_СтоимостьЧаса);  
		 Объект.ВКМ_СтоимостьЧаса = Неопределено;
		 
	 КонецЕсли;	
	 
КонецПроцедуры	 

// ВКМ Добавление доп. реквизитов на форму при выборе выида договора Абонентское обслуживание

#КонецОбласти