#Область ОбработчикиСобытийФормы
	&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавлениеРеквизитов();	
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда	
		
		СделатьВидимымиДобавленныеРеквизиты();
		
	КонецЕсли;                                    
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ВКМ Добавление доп. реквизитов на форму при выборе вида договора Абонентское обслуживание
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)

		
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
	
	СделатьВидимымиДобавленныеРеквизиты();
	
	Иначе СделатьНевидимымиДобавленныеРеквизиты(); 
		
	КонецЕсли;	   
	
КонецПроцедуры       

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

 &НаСервере
  Процедура ДобавлениеРеквизитов()   
		  
		  ПолеВвода = Элементы.Добавить("ФормаВКМ_ДатаНачала", Тип("ПолеФормы"), ЭтотОбъект);
		  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		  ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
		  ПолеВвода.Видимость = Ложь;
		  
		  ПолеВвода = Элементы.Добавить("ФормаВКМ_ДатаОкончания", Тип("ПолеФормы"), ЭтотОбъект);
		  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		  ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";     
		  ПолеВвода.Видимость = Ложь;
	
		  ПолеВвода = Элементы.Добавить("ФормаВКМ_СуммаЕжемесячнойПлаты", Тип("ПолеФормы"), ЭтотОбъект);
		  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		  ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаЕжемесячнойПлаты";   
		  ПолеВвода.Видимость = Ложь;
	
		  ПолеВвода = Элементы.Добавить("ФормаВКМ_СтоимостьЧаса", Тип("ПолеФормы"), ЭтотОбъект);
		  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		  ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса";  
		  ПолеВвода.Видимость = Ложь;
	  
КонецПроцедуры	 

&НаСервере
Процедура СделатьВидимымиДобавленныеРеквизиты();
   
	
	ДатаНачала =  Элементы.Найти("ФормаВКМ_ДатаНачала");
	ДатаНачала.Видимость = Истина;  
	
	
	ДатаОкончания = Элементы.Найти("ФормаВКМ_ДатаОкончания");
	ДатаОкончания.Видимость = Истина;
	
	СуммаЕжемесячнойПлаты = Элементы.Найти("ФормаВКМ_СуммаЕжемесячнойПлаты");
	СуммаЕжемесячнойПлаты.Видимость = Истина;
	
	СтоимостьЧаса = Элементы.Найти("ФормаВКМ_СтоимостьЧаса");
	СтоимостьЧаса.Видимость = Истина; 
	
	
КонецПроцедуры	

 &НаСервере
 Процедура СделатьНевидимымиДобавленныеРеквизиты()    
	 
	 ДатаНачала =  Элементы.Найти("ФормаВКМ_ДатаНачала");
	 ДатаНачала.Видимость = Ложь;  
	 
	 
	 ДатаОкончания = Элементы.Найти("ФормаВКМ_ДатаОкончания");
	 ДатаОкончания.Видимость = Ложь;
	 
	 СуммаЕжемесячнойПлаты = Элементы.Найти("ФормаВКМ_СуммаЕжемесячнойПлаты");
	 СуммаЕжемесячнойПлаты.Видимость = Ложь;
	 
	 СтоимостьЧаса = Элементы.Найти("ФормаВКМ_СтоимостьЧаса");
	 СтоимостьЧаса.Видимость = Ложь; 
	 
КонецПроцедуры	 

// ВКМ Добавление доп. реквизитов на форму при выборе выида договора Абонентское обслуживание

#КонецОбласти