#Область ОбработчикиСобытий

&НаСервере
Процедура ЗаполнитьНаСервере(Период)
	
	Объект.Выплаты.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
	
	Запрос.УстановитьПараметр("Период",Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Стр = Объект.Выплаты.Добавить(); 
		Стр.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник; 
		Стр.Сумма = ВыборкаДетальныеЗаписи.СуммаОстаток;   
		
	КонецЦикла; 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда) 
	Период = НачалоДня(Объект.Дата);
	ЗаполнитьНаСервере(Период);
КонецПроцедуры

#КонецОбласти